## ***Pandas***

*  In contrast to NumPy, which requires that all entries in an array be of the same type, pandas allows each column to have a separate type.
*  Ability to ingest from a great variety of file formats and data‐
bases, like SQL, Excel files, and comma-separated values (CSV) files. 
*  Provides rich data structures and functions designed to make working with
structured data fast, easy, and expressive.
* The pandas name itself is derived from panel data.
*  pandas is built on top of NumPy and makes it easy to
use in NumPy-centric applications.

In [0]:
import pandas as pd
# create a simple dataset of people
data = {'Name': ["John", "Anna", "Peter", "Linda"],
 'Location' : ["New York", "Paris", "Berlin", "London"],
 'Age' : [24, 13, 53, 33]
 }
data_pandas = pd.DataFrame(data)
# IPython.display allows "pretty printing" of dataframes
# in the Jupyter notebook
display(data_pandas)

    Name  Location  Age
0   John  New York   24
1   Anna     Paris   13
2  Peter    Berlin   53
3  Linda    London   33

* There are several possible ways to query this table. For example:

In [0]:
# Select all rows that have an age column greater than 30
display(data_pandas[data_pandas.Age > 30])

    Name Location  Age
2  Peter   Berlin   53
3  Linda   London   33

* Two workhorse data structures in pandas: Series and DataFrame.
* A Series is a one-dimensional array-like object containing an array of data (of any NumPy data type) and an associated array of data labels, called its index.

***Series***

In [0]:
from pandas import Series, DataFrame
import pandas as pd
obj = Series([4, 7, -5, 3])
print(obj)
#print(obj.values)
#print(obj.index)
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c']) #Series with an index
print(obj2) #obj2.index, obj2.values can be used
print(obj2['a'],obj2['d'])  #accessing values
#other operations: obj2[['c', 'a', 'd']], obj2[obj2 > 0] , obj2 * 2 ,np.exp(obj2)
#Another way to think about a Series is as a fixed-length, ordered dict, as it is a 
#mapping of index values to data values. It can be substituted into many functions that expect a
#dict
print('b' in obj2)
print('e' in obj2)
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj3 = Series(sdata)
obj4 = Series(sdata, index=states) 
print(obj4)
#Since,no value for 'California' was found, it appears as NaN (not a number) 
#which is considered in pandas to mark missing or NA values.
#The isnull and notnull functions in pandas should be used to detect missing data
pd.isnull(obj4) #or obj4.isnull()
pd.notnull(obj4)  #obj4.notnull()
print(obj3 + obj4)
#Both the Series object itself and its index have a name attribute, which integrates 
#with other key areas of pandas functionality.
obj4.name = 'population'
obj4.index.name = 'state'
#A Series’s index can be altered in place by assignment
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

0    4
1    7
2   -5
3    3
dtype: int64
d    4
b    7
a   -5
c    3
dtype: int64
-5 4
True
False
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64
California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

***Dataframe***
* A DataFrame represents a tabular, spreadsheet-like data structure containing an ordered collection of columns, each of which can be a different value type.
* The DataFrame has both a row and column index; it can be
thought of as a dict of Series (one for all sharing the same index).

In [0]:
import numpy as np
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)
#If you specify a sequence of columns, the DataFrame’s columns will be exactly what you pass.
DataFrame(data, columns=['year', 'state', 'pop']) #seq changed.
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
        index=['one', 'two', 'three', 'four', 'five'])
frame2.columns #access column names

frame2['state'] #or frame2.year  for all states or years with index
#frame2.ix['three'] #row retrieve doesnt work for pandas 1.0.0
frame2['debt'] = 16.5 #column assignment all values to 16.5
frame2['debt'] = np.arange(5.) #values from 0 to 4 in each row
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val #missing values assigned NaN
frame2['eastern'] = frame2.state == 'Ohio' #if not a column creates a new column
# values vary as true or false if state=='Ohio'
del frame2['eastern']  #del col

pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}   #nested dict
#it will interpret the outer dict keys as the columns and the inner keys as the row indices
frame3 = DataFrame(pop)
frame3.T  #transpose

pdata = {'Ohio': frame3['Ohio'][:-1], 'Nevada': frame3['Nevada'][:2]}  #Dicts of Series
#frame3.index.name = 'year'; frame3.columns.name = 'state'  for assigning name
#frame3.values

## Index Objects

In [0]:
obj = Series(range(3), index=['a', 'b', 'c'])
index = obj.index #outputs Index([a, b, c]
index[1:] #Index([b, c])
#index[1] = 'd'  # ERROR:Index objects are immutable and thus can’t be modified by the user.
index = pd.Index(np.arange(3)) #Immutability is important so that Index objects can be safely 
#shared among data structures
obj2 = Series([1.5, -2.5, 0], index=index)
obj2.index is index #OUTPUT: True
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = DataFrame(pop)
print('Ohio' in frame3.columns)  #OUTPUT: True
print(2003 in frame3.index)   #OUTPUT: False

True
False

## Essential Functionality


1.   Reindexing
    * Works for both series and Dataframe.

In [0]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])  #rearranges the data according to the 
# new index and places value for: e=NaN
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)  #value e=0
#Time series values: for interpolation use method
#ffill or pad Fill (or carry) values forward
#bfill or backfill Fill (or carry) values backward
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method='ffill')

#Dataframe
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],
       columns=['Ohio', 'Texas', 'California'])
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states) #column reindexing
#frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill', columns=states) #reindexing both

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

2.  Dropping entries from an axis

In [0]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
new_obj = obj.drop('c')
print(obj.drop(['d', 'c']))

data = DataFrame(np.arange(16).reshape((4, 4)),
        index=['Ohio', 'Colorado', 'Utah', 'New York'],
        columns=['one', 'two', 'three', 'four'])
data.drop(['Colorado', 'Ohio'])
data.drop('two', axis=1) 
data.drop(['two', 'four'], axis=1)

a    0.0
b    1.0
e    4.0
dtype: float64

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

3.   Indexing, selection, and filtering
    *  Analogously to NumPy array indexing, except you can
use the Series’s index values instead of only integers.

In [0]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
print(obj['b'], obj[1], obj[2:4], obj[['b', 'a', 'd']],
       obj[[1, 3]], obj[obj < 2] )
#Slicing
obj2=(obj['b':'c']) # endpoint is inclusive
obj['b':'c'] = 5  #set values of (b,c)=(5,5)

data = DataFrame(np.arange(16).reshape((4, 4)),
        index=['Ohio', 'Colorado', 'Utah', 'New York'],
        columns=['one', 'two', 'three', 'four'])
data['two']  
data[['three', 'one']]
data[:2] 
data[data['three'] > 5] #prints entries with satisfied condition
data < 5  #OUTPUTS true or false for every value

1.0 1.0 c    2.0
d    3.0
dtype: float64 b    1.0
a    0.0
d    3.0
dtype: float64 b    1.0
d    3.0
dtype: float64 a    0.0
b    1.0
dtype: float64

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

## Arithmetic and data alignment

In [0]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])
s1+s2   #unknown values= NaN
#add,sub,div,mul or +,-,/,*

df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
      index=['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
      index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

1.  Arithmetic methods with fill values

In [0]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
df1+df2 #missing values=NaN
df1.add(df2, fill_value=0)  #missing values=0
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

2. Operations between DataFrame and Series

In [0]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
        index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = Series(range(3), index=['b', 'd', 'e']) 
frame - series
series2 = Series(range(3), index=['b', 'e', 'f'])
frame + series2
series3 = frame['d']
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

## Function Application and Mapping

In [0]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
      index=['Utah', 'Ohio', 'Texas', 'Oregon'])  #(data,col_name,index)
np.abs(frame)   #gives absolute value of data
f = lambda x: x.max() - x.min()
frame.apply(f)    #functions can be used to define 1D array/series (b,d,e) as index
frame.apply(f, axis='columns')    #series with 'Utah', 'Ohio', 'Texas', 'Oregon' as index
def f(x):     #def can also be used 
  return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)
format = lambda x: '%.2f' % x
frame.applymap(format)    #element wise
frame['e'].map(format)  #map for series with column e

Utah      -0.30
Ohio       1.06
Texas      0.53
Oregon     0.78
Name: e, dtype: object

## Sorting and Ranking

In [0]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()    #sorted indexes: a,b,c,d
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
        index=['three', 'one'], columns=['d', 'a', 'b', 'c'])
frame.sort_index()    #sorting dataframe index: one, three
frame.sort_index(axis=1)  #sort columns: a,b,c,d
frame.sort_index(axis=1, ascending=False)   #decending
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()   #sort by value
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()   #sorting missing values at the end

frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame.sort_values(by='b')  #sort column b
frame.sort_values(by=['a', 'b'])    #sort column a,b
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()    #sort wrt mean rank
obj.rank(method='first')  #Assign ranks in the order the values appear in the data
obj.rank(ascending=False, method='max')   #descending order
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
       'c': [-2, 5, 8, -2.5]})
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

## Axis Indexes with Duplicate Labels

In [0]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])  #valid
obj.index.is_unique #false: tells if index is unique
obj['a']  #returns two values
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df.loc['b']   #returns two rows

          0         1         2
b  0.906547  1.007452 -0.460377
b -0.869385 -0.380483 -0.616204

## Summarizing and Computing Descriptive Statistics

In [0]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
    [np.nan, np.nan], [0.75, -1.3]],
    index=['a', 'b', 'c', 'd'],columns=['one', 'two'])
df.sum()  # returns sum of two columns
df.sum(axis='columns') #or df.sum(axis=1) gives sum row wise
df.mean(axis='columns', skipna=False) 
#Disable: NA values are excluded unless the entire slice (row or column in this case) is NA.
df.idxmax() #or df.idxmin() returns index of max or min
df.cumsum() #statistic accumulation
df.describe() # IMP:gives multiple statistics in one shot
#works for series too.

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

## Correlation and Covariance

In [0]:
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker)
 for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
price = pd.DataFrame({ticker: data['Adj Close']
 for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
 for ticker, data in all_data.items()})

returns = price.pct_change()  #percentage change
returns.tail()  # trailing values
returns['MSFT'].corr(returns['IBM'])  #correlation between two col
returns['MSFT'].cov(returns['IBM']) #covariance
#returns.MSFT.corr(returns.IBM) same as above
returns.corr()  #complete corr matrix
returns.cov()   #complete cov matrix
returns.corrwith(returns.IBM)   #corr between df row/col with other df/series: pct_change with IBM
returns.corrwith(volume)

AAPL   -0.141157
IBM    -0.097038
MSFT   -0.036711
GOOG   -0.042289
dtype: float64

## Unique Values, Value Counts, and Membership

In [0]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
uniques = obj.unique()  #returns array with unique values
uniques.sort()  #returns sorted values
obj.value_counts()  #returns count of occurence descending order
pd.value_counts(obj.values, sort=False)
mask = obj.isin(['b', 'c']) #returns true/false if present/absent
obj[mask] #returns series with index
#to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
#unique_vals = pd.Series(['c', 'b', 'a'])
#pd.Index(unique_vals).get_indexer(to_match)  works the same as above

0    c
5    b
6    b
7    c
8    c
dtype: object

## Data Loading, Storage, and File Formats

##   Reading and Writing Data in Text Format

In [0]:
!type examples/ex1.csv  #gets raw data (type replaced by cat in unix system)
#when data has header col names
df = pd.read_csv('examples/ex1.csv')  #read into dataframe: ',' as default seperator
pd.read_table('examples/ex1.csv', sep=',')  #read into dataframe: '\t' as default seperator

#when data doesnt have header col names
pd.read_csv('examples/ex2.csv', header=None)
pd.read_csv('examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])
names = ['a', 'b', 'c', 'd', 'message']
pd.read_csv('examples/ex2.csv', names=names, index_col='message')#msg col=index col
parsed = pd.read_csv('examples/csv_mindex.csv',
                     index_col=['key1', 'key2'])  #hierarchical data (keys with duplicates)
list(open('examples/ex3.txt'))  #text file with whitespace
result = pd.read_table('examples/ex3.txt', sep='\s+') #delimiter= whitespace
# if no col name for 1st col= col1 acts as index in df
res=pd.read_csv('examples/ex4.csv', skiprows=[0, 2, 3]) #skip col
pd.isnull(res)  #returns true/false 
result = pd.read_csv('examples/ex5.csv', na_values=['NULL'])  #consider missing val
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}  #specified by [row,col]
pd.read_csv('examples/ex5.csv', na_values=sentinels)

## Reading Data to Text Format

In [0]:
pd.options.display.max_rows = 10  #max rows display
result = pd.read_csv('examples/ex6.csv')
pd.read_csv('examples/ex6.csv', nrows=5)
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)
#iterate over chunk
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

tot = tot.sort_values(ascending=False)
tot[:10]  #display 10 rows

## Writing Data to Text Format

In [0]:
data = pd.read_csv('examples/ex5.csv')
data.to_csv('examples/out.csv') #write
import sys
data.to_csv(sys.stdout, sep='|')  #print in console with limiter
data.to_csv(sys.stdout, na_rep='NULL')  #missing value replaced
data.to_csv(sys.stdout, index=False, header=False)  #remove index and col names
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c']) #select col

#series operation:similar
dates = pd.date_range('1/1/2000', periods=7)
ts = pd.Series(np.arange(7), index=dates) #dates from 0 to 6
ts.to_csv('examples/tseries.csv')

## Working with Delimited Formats

In [0]:
import csv
f = open('examples/ex7.csv')

reader = csv.reader(f)
for line in reader:
    print(line)   #read line by line listed values
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))
header, values = lines[0], lines[1:]    #select header
data_dict = {h: v for h, v in zip(header, zip(*values))}  #dict of data col

class my_dialect(csv.Dialect):
 lineterminator = '\n'
 delimiter = ';'
 quotechar = '"'
 quoting = csv.QUOTE_MINIMAL
reader = csv.reader(f, dialect=my_dialect)  #working with different delimiters

reader = csv.reader(f, delimiter='|') #defined delimiter

with open('mydata.csv', 'w') as f:
 writer = csv.writer(f, dialect=my_dialect)
 writer.writerow(('one', 'two', 'three'))
 writer.writerow(('1', '2', '3'))
 writer.writerow(('4', '5', '6'))
 writer.writerow(('7', '8', '9'))

## JSON Data

In [0]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""
import json
result = json.loads(obj)
asjson = json.dumps(result) # Python object back to JSON:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])
data = pd.read_json('examples/example.json')
print(data.to_json())
print(data.to_json(orient='records'))

## XML and HTML: Web Scraping
Python has many libraries for reading and writing data in the ubiquitous HTML and
XML formats. Examples include lxml, Beautiful Soup, and html5lib. While lxml is
comparatively much faster in general, the other libraries can better handle malformed
HTML or XML files.

pandas has a built-in function, read_html, which uses libraries like lxml and Beautiful Soup to automatically parse tables out of HTML files as DataFrame objects.

In [0]:
#conda install lxml 
#pip install beautifulsoup4 html5lib
tables = pd.read_html('examples/fdic_failed_bank_list.html')
len(tables)
failures = tables[0]
failures.head()
close_timestamps = pd.to_datetime(failures['Closing Date'])
close_timestamps.dt.year.value_counts()

**Parsing XML with lxml.objectify**

In [0]:
from lxml import objectify

path = 'datasets/mta_perf/Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot() #parse and get roots
data = []

skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ',
               'DESIRED_CHANGE', 'DECIMAL_PLACES']

for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)
perf = pd.DataFrame(data) #dict to df
perf.head()
from io import StringIO #if metadata too
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()
root
root.get('href')
root.text

## Binary Data Formats

One of the easiest ways to store data (also known as serialization) efficiently in binary
format is using Python’s built-in pickle serialization. pandas objects all have a
to_pickle method that writes the data to disk in pickle format.

HDF5: storing large quantities of scientific
array data. It is available as a C library, and it has interfaces available in many other
languages, including Java, Julia, MATLAB, and Python. The “HDF” in HDF5 stands
for hierarchical data format.  Supports on-the-fly compres‐
sion with a variety of compression modes. For large datasets.

Can directly access HDF5 files using either the PyTables or h5py
libraries

In [0]:
frame = pd.read_csv('examples/ex1.csv')
frame
frame.to_pickle('examples/frame_pickle')
pd.read_pickle('examples/frame_pickle')
#!rm examples/frame_pickle
#Using HDF5 Format
frame = pd.DataFrame({'a': np.random.randn(100)})
store = pd.HDFStore('mydata.h5')
store['obj1'] = frame
store['obj1_col'] = frame['a']
#store
store['obj1'] #retrieve
#store as fixed or table:query
store.put('obj2', frame, format='table')
store.select('obj2', where=['index >= 10 and index <= 15'])
store.close()
frame.to_hdf('mydata.h5', 'obj3', format='table')
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])
os.remove('mydata.h5')

## Reading Microsoft Excel Files

In [0]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')
pd.read_excel(xlsx, 'Sheet1') #read sheet
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')
writer = pd.ExcelWriter('examples/ex2.xlsx')
frame.to_excel(writer, 'Sheet1')
writer.save()
frame.to_excel('examples/ex2.xlsx')
#!rm examples/ex2.xlsx

## Interacting with Web APIs

In [0]:
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
data = resp.json()
data[0]['title']
issues = pd.DataFrame(data, columns=['number', 'title',
                                     'labels', 'state'])

## Interacting with Databases

In [0]:
#SQL Server, PostgreSQL, and MySQL
import sqlite3
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""
con = sqlite3.connect('mydata.sqlite')
con.execute(query)
con.commit()
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()
#Most Python SQL drivers (PyODBC, psycopg2, MySQLdb, pymssql, etc.) return a list of tuples when selecting data from a table
cursor = con.execute('select * from test')
rows = cursor.fetchall()
cursor.description
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])
import sqlalchemy as sqla
db = sqla.create_engine('sqlite:///mydata.sqlite')
pd.read_sql('select * from test', db)
#!rm mydata.sqlite

## Data Cleaning and Preparation
1. Handling Missing Data:

For numeric data, pandas uses the floating-point
value NaN (Not a Number) to represent missing data. We call this a sentinel value that
can be easily detected.

In [0]:
import pandas as pd
import numpy as np
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data.isnull()    #displays true/false for notnull/null values

string_data[0] = None   #none is also null value
string_data.isnull()  #d[0]=null
#fillna used for filling NaN value

0     True
1    False
2     True
3    False
dtype: bool

2. Filtering Out Missing Data

In [0]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()   #drops all row with NA values
data[data.notnull()]  #same as dropna
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data.dropna(how='all')  # drop rows that are all NA
data[4] = NA
data.dropna(axis=1, how='all')  #col wise drop NA
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA #Rows 0-3, col 1
df.iloc[:2, 2] = NA #Rows 0-1, col 2
df.dropna()
#df.dropna(thresh=2)

          0         1         2
4  0.427898  0.478275  2.181719
5  0.355832  0.401154  0.487767
6 -0.838914 -0.286565  0.313073

3. Filling In Missing Data

In [0]:
df.fillna(0)  #fill with zeroes
df.fillna({1: 0.5, 2: 0}) #fill col 1 by 0.5, col 2 by 0
_ = df.fillna(0, inplace=True)  #fillna creates new obj, use inplace to avoid
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df.fillna(method='ffill')
df.fillna(method='ffill', limit=2)
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())  #fill with mean value

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Data Transformation
1.Removing Duplicates

In [0]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data.duplicated() #true/false if duplicate or not
data.drop_duplicates()  #drop duplicate
data['v1'] = range(7)
data.drop_duplicates(['k1'])  #drop duplicate for col k1
data.drop_duplicates(['k1', 'k2'], keep='last') #keep the last duplicate value

2. Transforming Data Using a Function or Mapping

In [0]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
meat_to_animal = {      #add col
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}
lowercased = data['food'].str.lower() #lowercase all first
lowercased
data['animal'] = lowercased.map(meat_to_animal) #col add
data
data['food'].map(lambda x: meat_to_animal[x.lower()]) #compact alternative

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

3. Replacing Values

In [0]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data
data.replace(-999, np.nan)
data.replace([-999, -1000], np.nan)
data.replace([-999, -1000], [np.nan, 0])
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

4. Renaming Axis Indexes

In [0]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
transform = lambda x: x[:4].upper()
data.index.map(transform) #uppercase index
data.index = data.index.map(transform)
data
data.rename(index=str.title, columns=str.upper) #uppercase col name
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)  #avoid new copy obj
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

5. Discretization and Binning

In [0]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins) #in bins of (18,25],(25,35]...
cats
cats.codes  #bin names o/p for each age: 0,1,2....
cats.categories   #bin range o/p: (18,25],(25,35]...
pd.value_counts(cats) #elements in each bin
pd.cut(ages, [18, 26, 36, 61, 100], right=False)  #in bins of [18,25),[25,35)...
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)
data = np.random.rand(20)
pd.cut(data, 4, precision=2)
data = np.random.randn(1000)  # Normally distributed
cats = pd.qcut(data, 4)  # Cut into quartiles
cats
pd.value_counts(cats)
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(1.305, 3.41], (-0.00982, 1.305], (-0.00982, 1.305], (-0.00982, 1.305], (-0.00982, 1.305], ..., (-1.245, -0.00982], (-1.245, -0.00982], (-0.00982, 1.305], (-3.483, -1.245], (-0.00982, 1.305]]
Length: 1000
Categories (4, interval[float64]): [(-3.483, -1.245] < (-1.245, -0.00982] < (-0.00982, 1.305] <
                                    (1.305, 3.41]]

6. Detecting and Filtering Outliers

In [0]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()
col = data[2]
col[np.abs(col) > 3]
data[(np.abs(data) > 3).any(1)] #select all rows having a value exceeding 3 or –3
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()
np.sign(data).head()  # produces 1 and –1

7. Permutation and Random Sampling

In [0]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
sampler = np.random.permutation(5)  #permutate 0 to 4
df.take(sampler)  #shuffle
df.sample(n=3)  #random subset
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)  #can repeat selection

8. Computing Indicator/Dummy Variables
*  converting a categorical variable into a “dummy” or “indicator” matrix

In [0]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
pd.get_dummies(df['key']) #col/keys:a,b,c, index(0 to 5), values[i][j]=0/1 shuffled
dummies = pd.get_dummies(df['key'], prefix='key') #col/keys:key_a,key_b,key_c
df_with_dummy = df[['data1']].join(dummies)
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                       header=None, names=mnames)
movies[:10]
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))
genres = pd.unique(all_genres)
genres
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns=genres)
gen = movies.genres[0]
gen.split('|')
dummies.columns.get_indexer(gen.split('|'))
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]
np.random.seed(12345)
values = np.random.rand(10)
values
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

## String Manipulation
1. String Object Methods

In [0]:
val = 'a,b,  guido'
val.split(',')  # ['a', 'b', ' guido'], has spaces
pieces = [x.strip() for x in val.split(',')]  #['a', 'b', 'guido']
first, second, third = pieces
first + '::' + second + '::' + third  #'a::b::guido'
'::'.join(pieces) #'a::b::guido'
'guido' in val  #true
val.index(',')  #1
val.find(':') #-1
val.index(':')  #substring not found
val.count(',')  #2
val.replace(',', '::')  #'a::b:: guido'
val.replace(',', '')  #'ab guido'

2. Regular Expressions
* The re module functions fall into three categories: pattern matching, substitution,
and splitting.

In [0]:
import re
text = "foo    bar\t baz  \tqux"
re.split('\s+', text) #['foo', 'bar', 'baz', 'qux'], already compiled
regex = re.compile('\s+') #compile
regex.split(text) #split
regex.findall(text) # [' ', '\t ', ' \t']
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)
regex.findall(text)
m = regex.search(text)  # returns a special match object for the first email address in the text
text[m.start():m.end()]
print(regex.match(text))  # None, as it only will match if the pattern occurs at the start of the string
print(regex.sub('REDACTED', text))
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)
m = regex.match('wesm@bright.net')
m.groups()
regex.findall(text)
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

3. Vectorized String Functions in pandas

In [0]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data.isnull()
data.str.contains('gmail')  #returns true/false
data.str.findall(pattern, flags=re.IGNORECASE)
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches.str.get(1)
matches.str[0]
data.str[:5]  #slice strings